open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sdmmc.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_sdmmc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.
 * The ASF licenses this file to you under the Apache License, Version
 * 2.0 (the "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.  See the License for the specific language governing
 * permissions and limitations under the License.
 *
 * STM32N6 SDMMC driver for NuttX.
 * Supports SDMMC1-2 in 4-bit SD mode with DMA.
 *
 * Adapted from STM32H7 NuttX reference (stm32_sdmmc.c).
 * Reference: STM32N6 HAL (stm32n6xx_hal_sd.c, stm32n6xx_ll_sdmmc.c)
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/kmalloc.h>
#include <nuttx/semaphore.h>
#include <nuttx/fs/fs.h>
#include <nuttx/cache.h>
#include <syslog.h>
#include <string.h>
#include <errno.h>

#include "arm_internal.h"
#include "stm32n6_gpio.h"
#include "stm32n6_sdmmc.h"
#include "hardware/stm32_memorymap.h"
#include "hardware/stm32_rcc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* SDMMC register base addresses (per CMSIS stm32n647xx.h) */

/* STM32N6 SDMMC bases -- SECURE aliases (NuttX runs in the secure domain,
 * same as the DMA2D/NPU base usages).  Per CMSIS:
 *   SDMMC1_BASE_S = AHB5PERIPH_BASE_S(0x58020000) + 0x7000 = 0x58027000
 *   SDMMC2_BASE_S = AHB5PERIPH_BASE_S(0x58020000) + 0x6800 = 0x58026800
 * (The 0x48... non-secure aliases must NOT be used here.)
 */
#define STM32N6_SDMMC1_BASE  0x58027000
#define STM32N6_SDMMC2_BASE  0x58026800

/* RCC AHB5/CCIPR aliases and bits (RM0486 Rev 2):
 *  - RCC_AHB5ENR    @0x260  (status/shadow; bits are RIFSC SEC/PRIV
 *                            security-protected)
 *  - RCC_AHB5ENSR   @0xA60  (write-1-to-set enable alias; HW-recommended,
 *                            used by ST LL_AHB5_GRP1_EnableClock)
 *  - RCC_AHB5LPENSR @0xAA0  (write-1-to-set sleep-mode enable alias)
 *  - RCC_AHB5RSTSR  @0xA20  (write-1-to-set reset alias; triggers reset)
 *  - RCC_AHB5RSTCR  @0x1220 (write-1-to-clear reset alias; releases reset)
 *    NOTE: the earlier comment/offset 0xA24 was wrong (CMSIS: AHB5RSTSR
 *    @0x0A20, AHB5RSTCR @0x1220).
 *  - RCC_CCIPR8     @0x160  (SDMMC1SEL bits 1:0 / SDMMC2SEL bits 5:4)
 * SDMMC1/2 enable/LPEN/RST bits are bit 8 / bit 7 (same layout in all of
 * these registers, per the RM tables).
 */
#define STM32_RCC_AHB5ENSR    (STM32_RCC_BASE + 0x0A60)
#define STM32_RCC_AHB5LPENSR  (STM32_RCC_BASE + 0x0AA0)
#define STM32_RCC_AHB5RSTSR   (STM32_RCC_BASE + 0x0A20)
#define STM32_RCC_AHB5RSTCR   (STM32_RCC_BASE + 0x1220)
#define STM32_RCC_CCIPR8      (STM32_RCC_BASE + 0x0160)

#define RCC_AHB5RSTR_SDMMC1RST   (1 << 8)
#define RCC_AHB5RSTR_SDMMC2RST   (1 << 7)
#define RCC_CCIPR8_SDMMC1SEL     (0x3 << 0)
#define RCC_CCIPR8_SDMMC2SEL     (0x3 << 4)

/* SDMMC register offsets */

#define SDMMC_POWER_OFFSET     0x00
#define SDMMC_CLKCR_OFFSET    0x04
#define SDMMC_ARG_OFFSET      0x08
#define SDMMC_CMD_OFFSET      0x0C
#define SDMMC_RESPCMD_OFFSET  0x10
#define SDMMC_RESP1_OFFSET    0x14
#define SDMMC_RESP2_OFFSET    0x18
#define SDMMC_RESP3_OFFSET    0x1C
#define SDMMC_RESP4_OFFSET    0x20
#define SDMMC_DTIMER_OFFSET   0x24
#define SDMMC_DLEN_OFFSET     0x28
#define SDMMC_DCTRL_OFFSET    0x2C
#define SDMMC_DCOUNT_OFFSET   0x30
#define SDMMC_STA_OFFSET      0x34
#define SDMMC_ICR_OFFSET      0x38
#define SDMMC_MASK_OFFSET     0x3C
#define SDMMC_IDMACTRL_OFFSET 0x50
#define SDMMC_IDMABS_OFFSET   0x54
#define SDMMC_FIFO_OFFSET     0x80

/* SDMMC_POWER bits */

#define SDMMC_POWER_PWRCTRL_MASK  0x03
#define SDMMC_POWER_PWRCTRL_ON    0x03

/* SDMMC_CLKCR bits */

/* STM32N6 SDMMC CLKCR (per CMSIS stm32n647xx.h):
 *   CLKDIV  = bits 9:0
 *   PWRSAV  = bit 12
 *   WIDBUS  = bits 15:14 (0b10 = 4-bit bus)
 *   NEGEDGE = bit 16  -- DE-PHASING selection, NOT a clock enable!
 * There is NO CLKEN bit on STM32N6; the SD clock is gated by the
 * SDMMC_POWER.PWRCTRL field (set below to 0b11 = power on).
 */
#define SDMMC_CLKCR_CLKDIV_MASK   0x3FF
#define SDMMC_CLKCR_WIDBUS_4BIT   (1 << 14)   /* SDMMC_BUS_WIDE_4B = WIDBUS_0 (bit14), per LL */
#define SDMMC_CLKCR_HWFC_EN       (1 << 17)   /* HWFC_EN bit17: RM0486 data xfer step 2 */

/* SDMMC_CMD bits */

#define SDMMC_CMD_CMDINDEX_MASK   0x3F
#define SDMMC_CMD_WAITRESP_MASK   (3 << 8)   /* CMSIS: bits 9:8 */
#define SDMMC_CMD_WAITRESP_NONE   (0 << 8)
#define SDMMC_CMD_WAITRESP_SHORT  (1 << 8)
#define SDMMC_CMD_WAITRESP_LONG   (3 << 8)
#define SDMMC_CMD_CPSMEN          (1 << 12)  /* CMSIS: bit 12 */
#define SDMMC_CMD_CMDTRANS        (1 << 6)   /* CMSIS: bit 6 (was 21!) */

/* SDMMC_STA bits */

#define SDMMC_STA_CCRCFAIL       (1 << 0)
#define SDMMC_STA_DCRCFAIL       (1 << 1)
#define SDMMC_STA_CTIMEOUT       (1 << 2)
#define SDMMC_STA_DTIMEOUT       (1 << 3)
#define SDMMC_STA_TXUNDERR       (1 << 4)
#define SDMMC_STA_RXOVERR        (1 << 5)
#define SDMMC_STA_CMDREND        (1 << 6)
#define SDMMC_STA_CMDSENT        (1 << 7)
#define SDMMC_STA_DATAEND        (1 << 8)
#define SDMMC_STA_DTO            (1 << 9)
#define SDMMC_STA_TXFIFOHE       (1 << 14)
#define SDMMC_STA_RXFIFOHF       (1 << 15)
#define SDMMC_STA_RXFIFOE        (1 << 19)   /* Receive FIFO empty */
#define SDMMC_STA_BUSYD0         (1 << 24)
#define SDMMC_STA_CPSMACT        (1 << 13)   /* Command path state machine
                                               * active (busy), per RM0486 */

/* Static command flags (== ST LL SDMMC_STATIC_CMD_FLAGS): cleared after
 * every command, exactly like HAL_SD_GetCmdError / GetCmdResp7. */
#define SDMMC_STATIC_CMD_FLAGS  (SDMMC_STA_CCRCFAIL | SDMMC_STA_CTIMEOUT | \
                                 SDMMC_STA_CMDREND | SDMMC_STA_CMDSENT)

/* SDMMC_DCTRL bits */

