open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sdmmc.c
#define SDMMC_DCTRL_DTEN         (1 << 0)
#define SDMMC_DCTRL_DTDIR_READ   (1 << 1)
#define SDMMC_DCTRL_DTMODE_BLOCK (0 << 2)
#define SDMMC_DCTRL_DBLOCKSIZE_MASK (0xF << 4)

/* SD commands */

#define SD_CMD_GO_IDLE_STATE      0
#define SD_CMD_SEND_IF_COND       8
#define SD_CMD_SEND_CSD           9
#define SD_CMD_SEND_CID           10
#define SD_CMD_STOP_TRANSMISSION  12
#define SD_CMD_SEND_STATUS        13
#define SD_CMD_SET_BLOCKLEN       16
#define SD_CMD_READ_SINGLE_BLOCK  17
#define SD_CMD_READ_MULT_BLOCK    18
#define SD_CMD_WRITE_SINGLE_BLOCK 24
#define SD_CMD_WRITE_MULT_BLOCK   25
#define SD_CMD_APP_CMD            55
#define SD_CMD_SD_SEND_OP_COND    41
#define SD_CMD_SWITCH             6   /* ACMD6 (after CMD55): SET_BUS_WIDTH */
#define SD_CMD_ALL_SEND_CID       2
#define SD_CMD_SEND_RELATIVE_ADDR 3

/* Timeouts */

#define SDMMC_TIMEOUT_MS   1000

#ifndef CONFIG_STM32N6_SDMMC_DEVPATH
#  define CONFIG_STM32N6_SDMMC_DEVPATH "/dev/mmcsd0"
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32n6_sdmmc_priv_s
{
  uint32_t base;
  uint32_t clock;
  int      irq;
  sem_t    lock;
  sem_t    wait;
  uint32_t rca;          /* Relative Card Address */
  uint32_t block_size;
  bool     initialized;
  uint32_t card_type;
  uint64_t block_count;  /* Derived from CSD */
  bool     block_registered;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* SDMMC1 pin table — TF card on the base board (per ALIENTEK 38_SD_Card
 * example, stm32n6xx_hal_msp.c): PC8-11 = D0-D3, PC12 = CK, PH2 = CMD,
 * all AF10.  SDMMC2 (SD NAND on the core board) is not wired up here.
 */

/* NOTE: each entry MUST include GPIO_MODE_AF | GPIO_OTYPE_PP (like
 * GPIO_USART1_TX / GPIO_XSPI1_IO0).  Without GPIO_MODE_AF the pin stays
 * MODER=00 (input) and stm32n6_configgpio() skips the AFR write entirely
 * (it only writes AF when mode == 2) -- verified on real HW via the
 * GPIOC/GPIOH MODER/AFR readback (AFRL/AFRH were 0x00000000).  That left
 * the SDMMC clock/CMD pins unconnected and the command state machine
 * never completed (CPSMACT stuck).  THIS WAS THE ROOT CAUSE.
 */

static const uint32_t g_sdmmc1_pins[] =
{
  GPIO_MODE_AF | GPIO_OTYPE_PP | GPIO_AF(10) | GPIO_SPEED_HIGH |
    GPIO_PUPD_NONE | GPIO_PORTC | GPIO_PIN(8),
  GPIO_MODE_AF | GPIO_OTYPE_PP | GPIO_AF(10) | GPIO_SPEED_HIGH |
    GPIO_PUPD_NONE | GPIO_PORTC | GPIO_PIN(9),
  GPIO_MODE_AF | GPIO_OTYPE_PP | GPIO_AF(10) | GPIO_SPEED_HIGH |
    GPIO_PUPD_NONE | GPIO_PORTC | GPIO_PIN(10),
  GPIO_MODE_AF | GPIO_OTYPE_PP | GPIO_AF(10) | GPIO_SPEED_HIGH |
    GPIO_PUPD_NONE | GPIO_PORTC | GPIO_PIN(11),
  GPIO_MODE_AF | GPIO_OTYPE_PP | GPIO_AF(10) | GPIO_SPEED_HIGH |
    GPIO_PUPD_NONE | GPIO_PORTC | GPIO_PIN(12),
  GPIO_MODE_AF | GPIO_OTYPE_PP | GPIO_AF(10) | GPIO_SPEED_HIGH |
    GPIO_PUPD_NONE | GPIO_PORTH | GPIO_PIN(2),
};

#define STM32N6_SDMMC1_NPINS   (sizeof(g_sdmmc1_pins) / sizeof(g_sdmmc1_pins[0]))

static struct stm32n6_sdmmc_priv_s g_sdmmc1_priv;
static struct stm32n6_sdmmc_priv_s g_sdmmc2_priv;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static const struct block_operations g_stm32n6_sdmmc_bops;

static inline uint32_t sdmmc_getreg(
    struct stm32n6_sdmmc_priv_s *priv, uint32_t offset)
{
  return *(volatile uint32_t *)(priv->base + offset);
}

static inline void sdmmc_putreg(
    struct stm32n6_sdmmc_priv_s *priv, uint32_t offset,
    uint32_t value)
{
  *(volatile uint32_t *)(priv->base + offset) = value;
}

static int sdmmc_wait_status(struct stm32n6_sdmmc_priv_s *priv,
                              uint32_t mask)
{
  uint32_t timeout = 5000000;

  while (timeout-- > 0)
    {
      uint32_t status = sdmmc_getreg(priv, SDMMC_STA_OFFSET);
      if (status & SDMMC_STA_CTIMEOUT)
        {
          sdmmc_putreg(priv, SDMMC_ICR_OFFSET,
                       SDMMC_STATIC_CMD_FLAGS);
          return -ETIMEDOUT;
        }

      /* ST HAL semantics (SDMMC_GetCmdResp7): a command is complete only
       * when the target flag is set AND CMDACT (CPSMACT) is cleared.
       * Waiting on CMDREND alone lets the next command be written while
       * the command state machine is still busy -> it freezes with
       * CPSMACT stuck (observed on real HW before this fix).
       * The response value must be read AFTER CPSMACT clears. */
      if ((status & mask) && !(status & SDMMC_STA_CPSMACT))
        {
          sdmmc_putreg(priv, SDMMC_ICR_OFFSET, mask);
          return 0;
        }
    }

  return -ETIMEDOUT;
}

/* Wait for CMDSENT (no-response command, e.g. CMD0).  Mirrors ST HAL
 * SDMMC_GetCmdError(): waits for CMDSENT, then clears ALL static command
 * flags.  Important: a no-response command does NOT raise CMDREND, so
 * the next command must not be queued before CMDSENT, otherwise the
 * command state machine overlaps and freezes (CPSMACT stuck). */

static int sdmmc_wait_cmdsent(struct stm32n6_sdmmc_priv_s *priv)
{
  uint32_t timeout = 5000000;

  while (timeout-- > 0)
    {
      uint32_t status = sdmmc_getreg(priv, SDMMC_STA_OFFSET);
      if (status & SDMMC_STA_CMDSENT)
        {
          sdmmc_putreg(priv, SDMMC_ICR_OFFSET,
                       SDMMC_STATIC_CMD_FLAGS);
          return 0;
        }

      if (status & SDMMC_STA_CTIMEOUT)
        {
          sdmmc_putreg(priv, SDMMC_ICR_OFFSET,
                       SDMMC_STATIC_CMD_FLAGS);
          return -ETIMEDOUT;
        }
    }

  syslog(LOG_ERR, "sdmmc: CMDSENT timeout (STA=0x%08lx)\n",
         (unsigned long)sdmmc_getreg(priv, SDMMC_STA_OFFSET));

  return -ETIMEDOUT;
}

/* Wait for the command path state machine to be idle (CPSMACT == 0).
 * NOTE: the previous code waited for CMDSENT/CMDREND here, which NEVER
 * asserts on the first command (there is nothing outstanding yet), so the
 * loop burned a full timeout before every CMD0.  Idle = CPSMACT clear.
 */

static int sdmmc_wait_idle(struct stm32n6_sdmmc_priv_s *priv)
{
  uint32_t timeout = 1000000;

