open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sdmmc.c
  while (timeout-- > 0)
    {
      if (!(sdmmc_getreg(priv, SDMMC_STA_OFFSET) & SDMMC_STA_CPSMACT))
        {
          return 0;
        }
    }

  syslog(LOG_ERR, "sdmmc: wait_idle timeout (STA=0x%08lx)\n",
         (unsigned long)sdmmc_getreg(priv, SDMMC_STA_OFFSET));

  return -ETIMEDOUT;
}

static int sdmmc_send_cmd(struct stm32n6_sdmmc_priv_s *priv,
                           uint32_t cmd, uint32_t arg,
                           uint32_t *resp)
{
  uint32_t cmdreg;
  int ret;

  /* ST HAL semantics: SDMMC_SendCommand() does NOT wait for the command
   * path to be idle before writing the CMD register (it only writes).
   * Keep it identical here -- waiting on CPSMACT before CMD8 deadlocks
   * when a previous command left CPSMACT set on N6.
   */

  /* Set argument */

  sdmmc_putreg(priv, SDMMC_ARG_OFFSET, arg);

  /* Configure command */

  cmdreg = cmd & SDMMC_CMD_CMDINDEX_MASK;
  cmdreg |= SDMMC_CMD_CPSMEN;

  if (resp != NULL)
    {
      cmdreg |= SDMMC_CMD_WAITRESP_SHORT;
    }

  /* Data-transfer commands (read/write block) must set CMDTRANS (bit 6)
   * per CMSIS stm32n647xx.h -- without it the data phase never starts. */

  if (cmd == SD_CMD_READ_SINGLE_BLOCK ||
      cmd == SD_CMD_READ_MULT_BLOCK ||
      cmd == SD_CMD_WRITE_SINGLE_BLOCK ||
      cmd == SD_CMD_WRITE_MULT_BLOCK)
    {
      cmdreg |= SDMMC_CMD_CMDTRANS;
    }

  /* Send command */

  sdmmc_putreg(priv, SDMMC_CMD_OFFSET, cmdreg);

  /* Wait for response.
   * NOTE (ST HAL semantics): SDMMC_SendCommand() never waits for a
   * response; the HAL waits in GetCmdResp1/7 (done in sdmmc_wait_status)
   * and clears the static command flags afterwards. */

  if (resp != NULL)
    {
      ret = sdmmc_wait_status(priv,
                               SDMMC_STA_CMDREND |
                               SDMMC_STA_CCRCFAIL);
      if (ret < 0)
        {
          return ret;
        }

      *resp = sdmmc_getreg(priv, SDMMC_RESP1_OFFSET);
    }
  else
    {
      /* No response expected (CMD0): ST HAL waits CMDSENT then clears
       * the static command flags (SDMMC_GetCmdError).  Without this the
       * next command is queued while CMD0 is still in flight and the
       * command state machine freezes (CPSMACT stuck, observed on real
       * HW). */
      ret = sdmmc_wait_cmdsent(priv);
      if (ret < 0)
        {
          return ret;
        }
    }

  return 0;
}

/* Send a command expecting a LONG (CSD/CID, 4x32bit) response.
 * CMD2 (CID) and CMD9 (CSD) use RESP4-1 registers.
 */

static int sdmmc_send_cmd_long(struct stm32n6_sdmmc_priv_s *priv,
                               uint32_t cmd, uint32_t arg,
                               uint32_t resp[4])
{
  uint32_t cmdreg;
  int ret;

  /* Same ST semantics as sdmmc_send_cmd: no pre-write idle wait. */

  sdmmc_putreg(priv, SDMMC_ARG_OFFSET, arg);

  cmdreg = (cmd & SDMMC_CMD_CMDINDEX_MASK) |
           SDMMC_CMD_WAITRESP_LONG |
           SDMMC_CMD_CPSMEN;
  sdmmc_putreg(priv, SDMMC_CMD_OFFSET, cmdreg);

  ret = sdmmc_wait_status(priv, SDMMC_STA_CMDREND |
                                 SDMMC_STA_CCRCFAIL);
  if (ret < 0)
    {
      syslog(LOG_ERR,
             "sdmmc: CMD%lu long response timeout (STA=0x%08lx)\n",
             (unsigned long)(cmd & SDMMC_CMD_CMDINDEX_MASK),
             (unsigned long)sdmmc_getreg(priv, SDMMC_STA_OFFSET));
      return ret;
    }

  resp[0] = sdmmc_getreg(priv, SDMMC_RESP1_OFFSET);
  resp[1] = sdmmc_getreg(priv, SDMMC_RESP2_OFFSET);
  resp[2] = sdmmc_getreg(priv, SDMMC_RESP3_OFFSET);
  resp[3] = sdmmc_getreg(priv, SDMMC_RESP4_OFFSET);

  return 0;
}

static int sdmmc_read_block(struct stm32n6_sdmmc_priv_s *priv,
                             uint32_t sector, void *buf)
{
  uint32_t *dst = (uint32_t *)buf;
  uint32_t status;
  uint32_t timeout;
  int ret;
  uint32_t i;
  uint32_t resp;

  /* Data path setup, ST HAL order (SDMMC_ConfigData with DPSM=DISABLE):
   * DCTRL must have direction/mode/block-size but NOT DTEN=1 before the
   * command -- RM0486: "When DTEN = 1, no command is transferred".  The
   * CMDTRANS bit set by sdmmc_send_cmd makes the CPSM issue DataEnable
   * to the DPSM at the end of the command, which starts the data phase.
   * (Writing DCTRL=0 leaves no direction/size -> data phase never starts;
   * observed as wait_status(DATAEND) timeout with STA=TXFIFOHE|TXFIFOE.) */
  sdmmc_putreg(priv, SDMMC_DCTRL_OFFSET,
               SDMMC_DCTRL_DTDIR_READ |
               SDMMC_DCTRL_DTMODE_BLOCK |
               (9 << 4));  /* 2^9 = 512, no DTEN */
  sdmmc_putreg(priv, SDMMC_DTIMER_OFFSET, 0x03FFFFFF);
  sdmmc_putreg(priv, SDMMC_DLEN_OFFSET, 512);

  /* Send read command (CMD17 expects R1 -- mirror ST HAL
   * SDMMC_CmdReadSingleBlock + GetCmdResp1) */

  ret = sdmmc_send_cmd(priv, SD_CMD_READ_SINGLE_BLOCK,
                        sector, &resp);
  if (ret < 0)
    {
      return ret;
    }

  /* Read data from FIFO.
   * HAL_SD_ReadBlocks style: on RXFIFOHF the WHOLE remaining block is
   * read in one sweep (HAL reads SDMMC_FIFO_SIZE/4 = 128 words when the
   * flag asserts), then the loop keeps polling for DATAEND/errors.  With
   * HWFC_EN=1 the receive data transfer is stalled whenever the RX FIFO
   * is not "half empty", so a timid 4-word-per-flag read freezes the card
   * in the middle of the block (observed: DCOUNT stuck at 0x1F0). */

  timeout = 1000000;
  i = 0;

  while (i < 128 && timeout-- > 0)  /* 512/4 = 128 words */
    {
      status = sdmmc_getreg(priv, SDMMC_STA_OFFSET);

      if (status & SDMMC_STA_RXOVERR)
        {
          return -EIO;
        }

      if (status & SDMMC_STA_RXFIFOHF)
        {
          /* Drain the FIFO completely (until RXFIFOE) so the HWFC flow
           * control sees a half-empty receive FIFO and restarts SDMMC_CK.
           * Fixed-size chunks left data behind and the transfer stayed
           * frozen (observed: DCOUNT stuck, no DATAEND). */
          while (i < 128)
            {
              status = sdmmc_getreg(priv, SDMMC_STA_OFFSET);
              if (status & SDMMC_STA_RXFIFOE)
                {
                  break;
                }

              dst[i++] = sdmmc_getreg(priv, SDMMC_FIFO_OFFSET);
            }

          if (i >= 128)
            {
              break;
            }
        }
    }

  /* Wait for data end */

  ret = sdmmc_wait_status(priv, SDMMC_STA_DATAEND);
  if (ret < 0)
    {
      return ret;
    }

