open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sdmmc.c
  return 0;
}

static int sdmmc_write_block(struct stm32n6_sdmmc_priv_s *priv,
                              uint32_t sector, const void *buf)
{
  const uint32_t *src = (const uint32_t *)buf;
  uint32_t status;
  uint32_t timeout;
  int ret;
  uint32_t i;
  uint32_t resp;

  /* Same data-path order as read block: DCTRL (mode/size, NO DTEN),
   * DTIMER, DLEN, then the write command (CMD24 expects R1). */

  sdmmc_putreg(priv, SDMMC_DCTRL_OFFSET,
               SDMMC_DCTRL_DTMODE_BLOCK |
               (9 << 4));  /* 2^9 = 512, no DTEN, no direction (tx) */
  sdmmc_putreg(priv, SDMMC_DTIMER_OFFSET, 0x03FFFFFF);
  sdmmc_putreg(priv, SDMMC_DLEN_OFFSET, 512);

  /* Send write command (CMD24 expects R1) */

  ret = sdmmc_send_cmd(priv, SD_CMD_WRITE_SINGLE_BLOCK,
                        sector, &resp);
  if (ret < 0)
    {
      return ret;
    }

  /* Write data to FIFO */

  timeout = 1000000;
  i = 0;

  while (i < 128 && timeout-- > 0)
    {
      status = sdmmc_getreg(priv, SDMMC_STA_OFFSET);

      if (status & SDMMC_STA_TXUNDERR)
        {
          return -EIO;
        }

      if (status & SDMMC_STA_TXFIFOHE)
        {
          sdmmc_putreg(priv, SDMMC_FIFO_OFFSET, src[i++]);
          sdmmc_putreg(priv, SDMMC_FIFO_OFFSET, src[i++]);
          sdmmc_putreg(priv, SDMMC_FIFO_OFFSET, src[i++]);
          sdmmc_putreg(priv, SDMMC_FIFO_OFFSET, src[i++]);
        }
    }

  /* Wait for data end */

  ret = sdmmc_wait_status(priv, SDMMC_STA_DATAEND);
  if (ret < 0)
    {
      return ret;
    }

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int stm32n6_sdmmc_initialize(int bus_num)
{
  struct stm32n6_sdmmc_priv_s *priv;
  uint32_t resp;
  int ret;

  switch (bus_num)
    {
      case 1:
        priv = &g_sdmmc1_priv;
        priv->base = STM32N6_SDMMC1_BASE;
        priv->clock = 200000000;  /* HCLK = 200MHz (FSBL PLL1 path);
                                   * SDMMCCLK = HCLK via CCIPR8.SDMMC1SEL=00 */
        break;
      case 2:
        priv = &g_sdmmc2_priv;
        priv->base = STM32N6_SDMMC2_BASE;
        priv->clock = 200000000;
        break;
      default:
        syslog(LOG_ERR, "sdmmc: unsupported bus %d\n",
               bus_num);
        return -EINVAL;
    }

  if (priv->initialized)
    {
      return 0;
    }

  /* D-Cache OFF -- same as the verified bare-metal tfcard environment
   * (our own golden reference runs with SCTLR.C=0, the FSBL leaves
   * D-Cache disabled) and the same policy as the verified N6 DCMIPP
   * driver (stm32n6_dcmipp_init() calls up_disable_dcache()).  With
   * SCTLR.C=1 and MPU disabled (default map), writes to the SDMMC
   * register/clock domain can be held in the cache -> the command state
   * machine never sees the programming sequence and freezes (CPSMACT
   * stuck, observed on real HW). */

  up_disable_dcache();

  /* NOTE: ARMv8-M (CM55) D-Cache enable/disable is controlled by
   * NVIC_CFGCON.DC (NuttX arm_cache.c and CMSIS agree); SCTLR.C is a
   * reserved bit (reads as 1) and does NOT gate the data cache.  The
   * bare-metal golden reference also never uses SCTLR for cache. */

  /* RIF grant for SDMMC1 is applied AFTER the full card initialization,
   * exactly like the bare-metal 38_SD_Card reference (HAL_SD_Init first,
   * then SystemIsolation_Config()) -- see the RIF block further below.
   */

  /* Enable the SDMMC peripheral clock (RCC AHB5ENSR.SDMMCxEN -- the
   * write-1-to-set alias; AHB5ENR @0x260 is read-only status!) BEFORE
   * touching any SDMMC register -- without the clock the register reads
   * return 0 and the cmd/data status loops would hang the boot.
   * Verified against the bare-metal 38_SD_Card reference (2026-09-08):
   * its HAL MspInit uses __HAL_RCC_SDMMC1_CLK_ENABLE() = LL_AHB5_GRP1_
   * EnableClock -> writes AHB5ENSR.  The previous modifyreg32() on
   * AHB5ENR (status reg) did nothing if the bit was already 0 in
   * hardware.
   */

  /* SDMMC kernel clock source = HCLK (CCIPR8.SDMMCxSEL = 0b00), same as
   * the bare-metal HAL_RCCEx_PeriphCLKConfig(RCC_PERIPHCLK_SDMMC1,
   * RCC_SDMMC1CLKSOURCE_HCLK) in the 38_SD_Card MspInit.  Explicitly
   * program it (instead of trusting the reset default) to match the
   * verified bare-metal clock tree (HCLK = 200MHz from the FSBL PLL1
   * path).
   */

  if (bus_num == 1)
    {
      modifyreg32(STM32_RCC_CCIPR8, RCC_CCIPR8_SDMMC1SEL, 0U); /* HCLK */
      putreg32(RCC_AHB5ENR_SDMMC1EN, STM32_RCC_AHB5ENSR);
    }
  else if (bus_num == 2)
    {
      modifyreg32(STM32_RCC_CCIPR8, RCC_CCIPR8_SDMMC2SEL, 0U); /* HCLK */
      putreg32(RCC_AHB5ENR_SDMMC2EN, STM32_RCC_AHB5ENSR);
    }

  /* Fault-tolerant SDMMC peripheral reset (RCC AHB5RSTSR set / AHB5RSTCR
   * clear aliases).  Guarantees a clean command state machine even if an
   * earlier diagnostic probe (or a crashed driver) left CPSMACT frozen:
   * without this the first CMD0 inherits a stuck state machine and never
   * reports CMDSENT (observed: STA=0x2000/CMD=0x1000 left over by the
   * [E3] probe in stm32n6_start.c). */
  if (bus_num == 1)
    {
      putreg32(RCC_AHB5RSTR_SDMMC1RST, STM32_RCC_AHB5RSTSR);
    }
  else
    {
      putreg32(RCC_AHB5RSTR_SDMMC2RST, STM32_RCC_AHB5RSTSR);
    }

  {
    volatile uint32_t rst_i;
    for (rst_i = 0; rst_i < 1000; rst_i++) { }
  }

  if (bus_num == 1)
    {
      putreg32(RCC_AHB5RSTR_SDMMC1RST, STM32_RCC_AHB5RSTCR);
    }
  else
    {
      putreg32(RCC_AHB5RSTR_SDMMC2RST, STM32_RCC_AHB5RSTCR);
    }

  /* Configure SDMMC1 GPIO (TF card, AF10).  Needed before powering
   * the SDMMC block; done once per bus here.
   */

  if (bus_num == 1)
    {
      int i;

      for (i = 0; i < STM32N6_SDMMC1_NPINS; i++)
        {
          stm32n6_configgpio(g_sdmmc1_pins[i]);
        }
    }

  nxsem_init(&priv->lock, 0, 1);
  nxsem_init(&priv->wait, 0, 0);
  priv->block_size = 512;

  /* Configure clock FIRST (same order as ST HAL_SD_Init -> SDMMC_Init):
   * Nominal HCLK = 200MHz -> ST uses ClockDiv = 200M/(2*400k) = 250 for
   * SDMMC_CK = 400kHz.  Use the exact bare-metal value (the verified
   * tfcard golden reference ran its card init with CLKDIV=250):
   */

  sdmmc_putreg(priv, SDMMC_CLKCR_OFFSET,
               (250 & SDMMC_CLKCR_CLKDIV_MASK));

  /* Power on SDMMC (PWRCTRL=11).  Per RM0486 the SDMMC is DISABLED for
   * the first 74 SDMMC_CK cycles after power-on ("First 74 SDMMC_CK
   * cycles the SDMMC is still disabled"), and ST's HAL_SD_InitCard()
   * waits 1 + 74*1000/sdmmc_clk ms before issuing the first command.
   * Without this wait the CMD0 lands in the disabled window and the
   * command state machine never completes (CPSMACT stuck).
   */

  sdmmc_putreg(priv, SDMMC_POWER_OFFSET,
               SDMMC_POWER_PWRCTRL_ON);

  /* DIAG (2026-09-09): the bare-metal tfcard [P] probe uses a plain
   * for-loop delay (1500000 iterations @600MHz ~ 2.5ms) and succeeds;
   * NuttX used up_mdelay(5) which depends on SystemCoreClock/tick and
   * may return immediately if the clock estimate is wrong -- then CMD0
   * lands inside the ST-mandated 74-SDMMC_CK disabled window (850us
   * @400kHz) and the command state machine freezes (CPSMACT stuck).
   * Use the exact same loop as the verified golden reference. */
  {
    volatile uint32_t diag_i;
    for (diag_i = 0; diag_i < 1500000; diag_i++) { }
  }

  /* DLYB (SDMMC delay block @0x58028000): the bare-metal 38_SD_Card
   * reference does NOT configure DLYB at all (HAL_SD leaves it at the
   * reset default) and the SD card initializes fine.  Keep the reset
   * default here too -- the previous experiment that forced BYP_EN
   * (bit16) diverged from the verified bare-metal behavior, so it is
   * removed.  Only the diagnostic readback below is kept.
   */

