open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sdmmc.c
  /* All bring-up diagnostics (register snapshots, MPU/CCR dumps)
   * were removed on 2026-09-10 after the SDMMC1/TF-card bring-up was
   * completed.  The essential initialization (peripheral reset, GPIO,
   * clocks, RIF, card init, ACMD6, HWFC, FIFO drain) stays below. */

  /* Send CMD0: GO_IDLE_STATE */

  ret = sdmmc_send_cmd(priv, SD_CMD_GO_IDLE_STATE, 0, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: GO_IDLE failed\n", bus_num);
      return ret;
    }

  /* Send CMD8: SEND_IF_COND (check voltage) */

  ret = sdmmc_send_cmd(priv, SD_CMD_SEND_IF_COND,
                        0x1aa, &resp);
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: SEND_IF_COND failed\n",
             bus_num);
      return ret;
    }

  /* ACMD41: SD_SEND_OP_COND (wait for ready).
   * NOTE: CMD55 (APP_CMD) expects an R1 response.  Sending it as a
   * no-response command (RESP NULL) leaves the command path busy
   * (CPSMACT), and the immediately following ACMD41 gets dropped /
   * frozen -- observed on real HW as "card not ready" after 100
   * retries.  Mirror ST HAL SDMMC_CmdAppCommand(): Response=SHORT +
   * GetCmdResp1.
   */

  int retry = 100;

  while (retry-- > 0)
    {
      ret = sdmmc_send_cmd(priv, SD_CMD_APP_CMD, 0, &resp);
      if (ret < 0)
        {
          syslog(LOG_INFO, "sdmmc%d: CMD55 failed (%d), retry...\n",
                 bus_num, ret);
          continue;
        }

      ret = sdmmc_send_cmd(priv, SD_CMD_SD_SEND_OP_COND,
                            0x40ff8000, &resp);
      if (ret < 0)
        {
          syslog(LOG_INFO, "sdmmc%d: ACMD41 failed (%d), retry...\n",
                 bus_num, ret);
          continue;
        }

      if (resp & 0x80000000)
        {
          break;
        }
    }

  if (retry <= 0)
    {
      syslog(LOG_ERR, "sdmmc%d: card not ready\n", bus_num);
      return -ETIMEDOUT;
    }

  /* CMD2: ALL_SEND_CID (136-bit LONG response) */

  {
    uint32_t cid[4];
    ret = sdmmc_send_cmd_long(priv, SD_CMD_ALL_SEND_CID, 0, cid);
    if (ret < 0)
      {
        syslog(LOG_ERR, "sdmmc%d: ALL_SEND_CID failed\n", bus_num);
        return ret;
      }
  }

  /* CMD3: SEND_RELATIVE_ADDR */

  ret = sdmmc_send_cmd(priv, SD_CMD_SEND_RELATIVE_ADDR,
                        0, &resp);
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: SEND_RCA failed\n", bus_num);
      return ret;
    }

  priv->rca = resp & 0xffff0000;

  /* Read CSD (CMD9) to derive the card capacity.  Standard SD 2.0
   * CSD v1.0: C_SIZE bits [73:62], C_SIZE_MULT [55:47], READ_BL_LEN
   * [83:80] -> (C_SIZE+1) * 2^(C_SIZE_MULT+2) * 2^READ_BL_LEN blocks.
   * CSD v2.0 (SDHC): CSD[7:0] word = resp[2], C_SIZE = 0x0FFFFF &
   * ((resp[1] & 0x3F) << 16 | resp[2] >> 16).
   *
   * NOTE: CMD9 is issued at 400kHz/1-bit (before the 4-bit/25MHz switch)
   * to match ST HAL_SD_InitCard order: a freshly ready card can answer
   * CMD9 slower than the 25MHz command-response timeout allows
   * (observed: CTIMEOUT/-110 when CMD9 was sent after the speed switch).
   */

  {
    uint32_t csd[4];
    uint64_t csize;
    uint64_t cmult;
    uint32_t read_bl_len;
    uint32_t csd_v2;

    ret = sdmmc_send_cmd_long(priv, SD_CMD_SEND_CSD, priv->rca, csd);
    if (ret < 0)
      {
        syslog(LOG_ERR, "sdmmc%d: CMD9 CSD failed: %d\n", bus_num, ret);
        return ret;
      }

    csd_v2 = (csd[0] >> 30) & 0x3;   /* CSD structure bits 127:126 */

    if (csd_v2 == 0x1)
      {
        /* SDHC (CSD v2.0): per ST HAL,
         * DeviceSize = ((CSD[1] & 0x3F) << 16) |
         *               ((CSD[2] & 0xFFFF0000) >> 16)
         * BlockNbr = (DeviceSize + 1) * 1024 (512-byte blocks).
         */

        csize = ((uint64_t)(csd[1] & 0x3f) << 16) |
                ((uint64_t)(csd[2] & 0xffff0000) >> 16);
        priv->block_count = (csize + 1) * 1024ULL;
      }
    else
      {
        /* SDSC (CSD v1.0): per ST HAL,
         * DeviceSize = ((CSD[1] & 0x3FF) << 2) |
         *               ((CSD[2] & 0xC0000000) >> 30)
         * DeviceSizeMul = (CSD[2] & 0x38000) >> 15
         * BlockNbr = (DeviceSize+1) * 2^(DeviceSizeMul+2)
         * LogBlockNbr = BlockNbr * BlockSize / 512
         */

        read_bl_len = (csd[1] >> 16) & 0xf;   /* bits 83:80 */
        csize  = ((uint64_t)(csd[1] & 0x3ff) << 2) |
                 ((uint64_t)(csd[2] & 0xc0000000) >> 30);
        cmult  = ((uint64_t)(csd[2] & 0x38000) >> 15);
        priv->block_count =
          (csize + 1) * (1ULL << (cmult + 2)) * (1ULL << read_bl_len) /
          512ULL;
      }

    syslog(LOG_INFO,
           "sdmmc%d: card initialized, RCA=%08lx, %llu blocks (CSD v%lu)\n",
           bus_num, (unsigned long)priv->rca,
           (unsigned long long)priv->block_count, csd_v2);
  }

  /* CMD7: SELECT_CARD (expects R1) */

  ret = sdmmc_send_cmd(priv, 7, priv->rca, &resp);
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: SELECT_CARD failed\n", bus_num);
      return ret;
    }

  /* CMD16: SET_BLOCKLEN to 512 (expects R1) */

  ret = sdmmc_send_cmd(priv, SD_CMD_SET_BLOCKLEN, 512, &resp);
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: SET_BLOCKLEN failed\n", bus_num);
      return ret;
    }

  /* Switch to 4-bit bus and higher clock (done AFTER the CSD read, per
   * ST HAL order: HAL_SD_InitCard runs at 400kHz/1-bit and only then
   * does HAL_SD_ConfigWideBusOperation switch the bus width/speed).
   *
   * CRITICAL (SD spec + ST HAL SD_WideBus_Enable): the CARD must be told
   * to switch to 4-bit with CMD55->ACMD6(SET_BUS_WIDTH, arg=2) BEFORE the
   * controller WIDBUS bits are changed.  Without it the card still drives
   * DAT0 only (1-bit), no start bit is seen on the 4-bit bus and the data
   * phase times out (observed: DCOUNT frozen at 0x200, DTIMEOUT). */

  ret = sdmmc_send_cmd(priv, SD_CMD_APP_CMD, priv->rca, &resp);
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: CMD55(APP_CMD) failed for wide-bus\n",
             bus_num);
      return ret;
    }

  ret = sdmmc_send_cmd(priv, SD_CMD_SWITCH, 2, &resp);  /* 2 = 4-bit */
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: ACMD6(SET_BUS_WIDTH) failed\n", bus_num);
      return ret;
    }

