open-vela/contest2026_294_shiqian/arch/arm/stm32n6/src/stm32n6_sdmmc.c
  syslog(LOG_INFO, "sdmmc%d: card switched to 4-bit (ACMD6 ok)\n", bus_num);

  sdmmc_putreg(priv, SDMMC_CLKCR_OFFSET,
               (4 & SDMMC_CLKCR_CLKDIV_MASK) |   /* SDMMC_CK = 200M/(2*4)=25MHz */
               SDMMC_CLKCR_WIDBUS_4BIT |
               SDMMC_CLKCR_HWFC_EN);  /* RM0486 data xfer step 2: HWFC_EN (bare-metal 0x24004) */

  priv->initialized = true;

  /* ---- RIF grant for SDMMC1 (applied AFTER card init, per bare-metal ----
   * ---- 38_SD_Card order: HAL_SD_Init first, then RIF config)      ----
   * RISC: SDMMC1 = RIF_PERIPH_REG1 | SEC21 -> RISC_SECCFGRx[1] bit21
   *   (RIFSC+0x14), RISC_PRIVCFGRx[1] bit21 (RIFSC+0x34).
   * RIMC: SDMMC1 internal IDMA master (index 2) = RIF_CID_1(0x2) | SEC |
   *   PRIV -> RIMC_ATTRx[2] (RIFSC+0xC18).  The reference configures it
   *   with MasterCID=RIF_CID_1, so mirror that exactly.
   */

  putreg32(RCC_AHB3ENR_RIFSCEN, STM32_RCC_AHB3ENSR);  /* RIFSC clock on */

  /* Bare-metal verified value (tfcard dump): RIMC_ATTR[SDMMC1]=0x310
   * = MCID=1 | MSEC | MPRIV. */
  modifyreg32(STM32_RIFSC_BASE + 0xC10 + (2u << 2), 0,
               (1u << 4) | (1u << 8) | (1u << 9));  /* MCID=1|SEC|PRIV */
  modifyreg32(STM32_RIFSC_BASE + 0x14, 0, (1u << 21));  /* SEC21  */
  modifyreg32(STM32_RIFSC_BASE + 0x34, 0, (1u << 21));  /* PRIV21 */

  syslog(LOG_INFO,
         "sdmmc%d: RIF RIMC[SDMMC1]=0x%08lx RIFSEC=0x%08lx RIFPRIV=0x%08lx\n",
         bus_num,
         (unsigned long)getreg32(STM32_RIFSC_BASE + 0xC10 + (2u << 2)),
         (unsigned long)getreg32(STM32_RIFSC_BASE + 0x14),
         (unsigned long)getreg32(STM32_RIFSC_BASE + 0x34));

  /* Register block device so the VFS can mount FATFS on it. */

  ret = register_blockdriver(CONFIG_STM32N6_SDMMC_DEVPATH,
                             &g_stm32n6_sdmmc_bops, 0666, priv);
  if (ret < 0)
    {
      syslog(LOG_ERR, "sdmmc%d: register_blockdriver failed: %d\n",
             bus_num, ret);
      return ret;
    }

  priv->block_registered = true;

  return 0;
}

int stm32n6_sdmmc_deinitialize(int bus_num)
{
  struct stm32n6_sdmmc_priv_s *priv;

  switch (bus_num)
    {
      case 1:
        priv = &g_sdmmc1_priv;
        break;
      case 2:
        priv = &g_sdmmc2_priv;
        break;
      default:
        return -EINVAL;
    }

  if (!priv->initialized)
    {
      return 0;
    }

  /* Power off */

  sdmmc_putreg(priv, SDMMC_POWER_OFFSET, 0);

  priv->initialized = false;
  nxsem_destroy(&priv->lock);
  nxsem_destroy(&priv->wait);

  syslog(LOG_INFO, "sdmmc%d: deinitialized\n", bus_num);
  return 0;
}

/****************************************************************************
 * Block Device Operations
 *
 * Wraps the SDMMC raw block read/write behind the NuttX block driver
 * interface so FATFS can mount /dev/mmcsd0.  This is a pragmatic
 * alternative to a full struct sdio_dev_s port (which the upstream
 * stm32_sdmmc.c implements for other STM32 families); the SDMMC1
 * registers and the FIFO transfer helpers below are already verified
 * for STM32N6.
 ****************************************************************************/

static int sdmmc_block_open(FAR struct inode *inode)
{
  return OK;
}

static int sdmmc_block_close(FAR struct inode *inode)
{
  return OK;
}

static ssize_t sdmmc_block_read(FAR struct inode *inode,
                                FAR unsigned char *buffer,
                                blkcnt_t start_sector,
                                unsigned int nsectors)
{
  FAR struct stm32n6_sdmmc_priv_s *priv = inode->i_private;
  unsigned int i;
  int ret;

  for (i = 0; i < nsectors; i++)
    {
      ret = sdmmc_read_block(priv, (uint32_t)(start_sector + i),
                             buffer + (i * priv->block_size));
      if (ret < 0)
        {
          return -EIO;
        }
    }

  /* NuttX block driver contract: return the number of SECTORS read
   * (not bytes).  fat_hwread() compares the return value against
   * nsectors; returning bytes (512) made every read look short and
   * fatal_mount() returned -ENODEV. */

  return (ssize_t)nsectors;
}

static ssize_t sdmmc_block_write(FAR struct inode *inode,
                                 FAR const unsigned char *buffer,
                                 blkcnt_t start_sector,
                                 unsigned int nsectors)
{
  FAR struct stm32n6_sdmmc_priv_s *priv = inode->i_private;
  unsigned int i;
  int ret;

  for (i = 0; i < nsectors; i++)
    {
      ret = sdmmc_write_block(priv, (uint32_t)(start_sector + i),
                              buffer + (i * priv->block_size));
      if (ret < 0)
        {
          return -EIO;
        }
    }

  /* NuttX block driver contract: return the number of SECTORS written. */

  return (ssize_t)nsectors;
}

static int sdmmc_block_geometry(FAR struct inode *inode,
                                FAR struct geometry *geometry)
{
  FAR struct stm32n6_sdmmc_priv_s *priv = inode->i_private;

  if (geometry == NULL)
    {
      return -EINVAL;
    }

  geometry->geo_available = true;
  geometry->geo_mediachanged = false;
  geometry->geo_writeenabled = true;
  geometry->geo_sectorsize = priv->block_size;
  geometry->geo_nsectors = priv->block_count;

  return OK;
}

static const struct block_operations g_stm32n6_sdmmc_bops =
{
  .open     = sdmmc_block_open,
  .close    = sdmmc_block_close,
  .read     = sdmmc_block_read,
  .write    = sdmmc_block_write,
  .geometry = sdmmc_block_geometry,
};
